> OK will give it a try. The other thing is that it's proposing these changes to the clickpipe
> ```
> development-clickhouse-clickpipe-rta-employees    # clickhouse_clickpipe.clickpipe-rta-employees_C755608E (clickpipe-rta-employees/clickpipe-rta-employees) will be updated in-place
>                                                   ~ resource "clickhouse_clickpipe" "clickpipe-rta-employees_C755608E" {
>                                                         id             = "de5cfbb6-a4ac-419c-859f-2bb0ab5cad0e"
>                                                         name           = "employees"
>                                                       ~ scaling        = {
>                                                           ~ replica_cpu_millicores = 125 -> (known after apply)
>                                                           ~ replica_memory_gb      = 0.5 -> (known after apply)
>                                                           + replicas               = (known after apply)
>                                                         } -> (known after apply)
>                                                         # (5 unchanged attributes hidden)
>                                                     }
> 
>                                                 Plan: 0 to add, 1 to change, 0 to destroy.
> ```
> We don't set `scaling` at all so it shouldn't be updating it, IIUC

Ah will take a look at not including this info in the plan at all to avoid confusion, this is the lowest and default scaling option so the same as not specifying scaling at all.